Ran Plan for dir: `eks` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_vpc.boop[0] will be created
+ resource "aws_vpc" "boop" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "192.127.127.0/24"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_cluster.data.template_file.configmap_auth[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "configmap_auth"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            apiVersion: v1
            kind: ConfigMap
            metadata:
              name: aws-auth
              namespace: kube-system
            data:
              mapRoles: |
                ${indent(4, map_worker_roles_yaml)}
            %{if map_additional_iam_roles_yaml != "[]" }
                ${indent(4, map_additional_iam_roles_yaml)}
            %{ endif }
            %{if map_additional_iam_users_yaml != "[]" }
              mapUsers: |
                ${indent(4, map_additional_iam_users_yaml)}
            %{ endif }
            %{if map_additional_aws_accounts_yaml != "[]" }
              mapAccounts: |
                ${indent(4, map_additional_aws_accounts_yaml)}
            %{ endif }
        EOT
      + vars     = {
          + "map_additional_aws_accounts_yaml" = jsonencode([])
          + "map_additional_iam_roles_yaml"    = jsonencode([])
          + "map_additional_iam_users_yaml"    = jsonencode([])
          + "map_worker_roles_yaml"            = (known after apply)
        }
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_eks_cluster.default[0] will be created
+ resource "aws_eks_cluster" "default" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "bemit-testing-test-k8s-cluster-cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Attributes" = "cluster"
          + "Name"       = "bemit-testing-test-k8s-cluster-cluster"
          + "Namespace"  = "bemit"
          + "Stage"      = "testing"
        }
      + version               = (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_iam_role.default[0] will be created
+ resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bemit-testing-test-k8s-cluster-cluster"
      + path                  = "/"
      + tags                  = {
          + "Attributes" = "cluster"
          + "Name"       = "bemit-testing-test-k8s-cluster-cluster"
          + "Namespace"  = "bemit"
          + "Stage"      = "testing"
        }
      + unique_id             = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_iam_role_policy_attachment.amazon_eks_cluster_policy[0] will be created
+ resource "aws_iam_role_policy_attachment" "amazon_eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "bemit-testing-test-k8s-cluster-cluster"
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_iam_role_policy_attachment.amazon_eks_service_policy[0] will be created
+ resource "aws_iam_role_policy_attachment" "amazon_eks_service_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "bemit-testing-test-k8s-cluster-cluster"
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_security_group.default[0] will be created
+ resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Security Group for EKS cluster"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "bemit-testing-test-k8s-cluster-cluster"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Attributes" = "cluster"
          + "Name"       = "bemit-testing-test-k8s-cluster-cluster"
          + "Namespace"  = "bemit"
          + "Stage"      = "testing"
        }
      + vpc_id                 = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_security_group_rule.egress[0] will be created
+ resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_security_group_rule.ingress_workers[0] will be created
+ resource "aws_security_group_rule" "ingress_workers" {
      + description              = "Allow the cluster to receive communication from the worker nodes"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.test-k8s-cluster.module.eks_cluster.local_file.configmap_auth[0] will be created
+ resource "local_file" "configmap_auth" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "~/.terraform/configmap-auth.yaml"
      + id                   = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_cluster.null_resource.apply_configmap_auth[0] will be created
+ resource "null_resource" "apply_configmap_auth" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_workers.data.template_file.userdata[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "userdata"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            #!/bin/bash
            
            # userdata for EKS worker nodes to properly configure Kubernetes applications on EC2 instances
            # https://docs.aws.amazon.com/eks/latest/userguide/launch-workers.html
            # https://aws.amazon.com/blogs/opensource/improvements-eks-worker-node-provisioning/
            # https://github.com/awslabs/amazon-eks-ami/blob/master/files/bootstrap.sh#L97
            
            ${before_cluster_joining_userdata}
            
            export KUBELET_EXTRA_ARGS=${bootstrap_extra_args}
            
            /etc/eks/bootstrap.sh --apiserver-endpoint '${cluster_endpoint}' --b64-cluster-ca '${certificate_authority_data}' '${cluster_name}'
            
            ${after_cluster_joining_userdata}
        EOT
      + vars     = {
          + "after_cluster_joining_userdata"  = ""
          + "before_cluster_joining_userdata" = ""
          + "bootstrap_extra_args"            = ""
          + "certificate_authority_data"      = (known after apply)
          + "cluster_endpoint"                = (known after apply)
          + "cluster_name"                    = "bemit-testing-test-k8s-cluster-cluster"
        }
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_instance_profile.default[0] will be created
+ resource "aws_iam_instance_profile" "default" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "bemit-testing-test-k8s-cluster-workers"
      + path        = "/"
      + role        = "bemit-testing-test-k8s-cluster-workers"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_role.default[0] will be created
+ resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bemit-testing-test-k8s-cluster-workers"
      + path                  = "/"
      + tags                  = {
          + "Attributes"                                                   = "workers"
          + "Name"                                                         = "bemit-testing-test-k8s-cluster-workers"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "owned"
        }
      + unique_id             = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_role_policy_attachment.amazon_ec2_container_registry_read_only[0] will be created
+ resource "aws_iam_role_policy_attachment" "amazon_ec2_container_registry_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "bemit-testing-test-k8s-cluster-workers"
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_role_policy_attachment.amazon_eks_cni_policy[0] will be created
+ resource "aws_iam_role_policy_attachment" "amazon_eks_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "bemit-testing-test-k8s-cluster-workers"
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_role_policy_attachment.amazon_eks_worker_node_policy[0] will be created
+ resource "aws_iam_role_policy_attachment" "amazon_eks_worker_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "bemit-testing-test-k8s-cluster-workers"
    }

  # module.test-k8s-cluster.module.eks_workers.aws_security_group.default[0] will be created
+ resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Security Group for EKS worker nodes"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "bemit-testing-test-k8s-cluster-workers"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Attributes"                                                   = "workers"
          + "Name"                                                         = "bemit-testing-test-k8s-cluster-workers"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_workers.aws_security_group_rule.egress[0] will be created
+ resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.test-k8s-cluster.module.eks_workers.aws_security_group_rule.ingress_cluster[0] will be created
+ resource "aws_security_group_rule" "ingress_cluster" {
      + description              = "Allow worker kubelets and pods to receive communication from the cluster control plane"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.test-k8s-cluster.module.eks_workers.aws_security_group_rule.ingress_self[0] will be created
+ resource "aws_security_group_rule" "ingress_self" {
      + description              = "Allow nodes to communicate with each other"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.test-k8s-cluster.module.subnets.data.aws_vpc.default will be read during apply
  # (config refers to values not yet known)
 <= data "aws_vpc" "default"  {
      + arn                     = (known after apply)
      + cidr_block              = (known after apply)
      + cidr_block_associations = (known after apply)
      + default                 = (known after apply)
      + dhcp_options_id         = (known after apply)
      + enable_dns_hostnames    = (known after apply)
      + enable_dns_support      = (known after apply)
      + id                      = (known after apply)
      + instance_tenancy        = (known after apply)
      + ipv6_association_id     = (known after apply)
      + ipv6_cidr_block         = (known after apply)
      + main_route_table_id     = (known after apply)
      + owner_id                = (known after apply)
      + state                   = (known after apply)
      + tags                    = (known after apply)
    }

  # module.test-k8s-cluster.module.subnets.aws_network_acl.private[0] will be created
+ resource "aws_network_acl" "private" {
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Attributes"                                                   = "private"
          + "Name"                                                         = "bemit-testing-test-k8s-cluster"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "cpco.io/subnet/type"                                          = "private"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared"
        }
      + vpc_id     = (known after apply)
    }

  # module.test-k8s-cluster.module.subnets.aws_network_acl.public[0] will be created
+ resource "aws_network_acl" "public" {
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Attributes"                                                   = "public"
          + "Name"                                                         = "bemit-testing-test-k8s-cluster"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "cpco.io/subnet/type"                                          = "public"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared"
        }
      + vpc_id     = (known after apply)
    }

  # module.test-k8s-cluster.module.subnets.aws_route.public[0] will be created
+ resource "aws_route" "public" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.test-k8s-cluster.module.subnets.aws_route_table.private[0] will be created
+ resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes"                                                   = "private"
          + "Name"                                                         = "bemit-testing-test-k8s-cluster-private-eu-west-1a"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "cpco.io/subnet/type"                                          = "private"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.test-k8s-cluster.module.subnets.aws_route_table.private[1] will be created
+ resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes"                                                   = "private"
          + "Name"                                                         = "bemit-testing-test-k8s-cluster-private-eu-west-1b"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "cpco.io/subnet/type"                                          = "private"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.test-k8s-cluster.module.subnets.aws_route_table.public[0] will be created
+ resource "aws_route_table" "public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes"                                                   = "public"
          + "Name"                                                         = "bemit-testing-test-k8s-cluster"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "cpco.io/subnet/type"                                          = "public"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.test-k8s-cluster.module.subnets.aws_route_table_association.private[0] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.test-k8s-cluster.module.subnets.aws_route_table_association.private[1] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.test-k8s-cluster.module.subnets.aws_route_table_association.public[0] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.test-k8s-cluster.module.subnets.aws_route_table_association.public[1] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.test-k8s-cluster.module.subnets.aws_subnet.private[0] will be created
+ resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.0.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Attributes"                                                   = "private"
          + "Name"                                                         = "bemit-testing-test-k8s-cluster-private-eu-west-1a"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "cpco.io/subnet/type"                                          = "private"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared"
        }
      + vpc_id                          = (known after apply)
    }

  # module.test-k8s-cluster.module.subnets.aws_subnet.private[1] will be created
+ resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.32.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Attributes"                                                   = "private"
          + "Name"                                                         = "bemit-testing-test-k8s-cluster-private-eu-west-1b"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "cpco.io/subnet/type"                                          = "private"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared"
        }
      + vpc_id                          = (known after apply)
    }

  # module.test-k8s-cluster.module.subnets.aws_subnet.public[0] will be created
+ resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.96.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Attributes"                                                   = "public"
          + "Name"                                                         = "bemit-testing-test-k8s-cluster-public-eu-west-1a"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "cpco.io/subnet/type"                                          = "public"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared"
        }
      + vpc_id                          = (known after apply)
    }

  # module.test-k8s-cluster.module.subnets.aws_subnet.public[1] will be created
+ resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.128.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Attributes"                                                   = "public"
          + "Name"                                                         = "bemit-testing-test-k8s-cluster-public-eu-west-1b"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "cpco.io/subnet/type"                                          = "public"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared"
        }
      + vpc_id                          = (known after apply)
    }

  # module.test-k8s-cluster.module.vpc.aws_default_security_group.default will be created
+ resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = []
      + id                     = (known after apply)
      + ingress                = []
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Default Security Group"
        }
      + vpc_id                 = (known after apply)
    }

  # module.test-k8s-cluster.module.vpc.aws_internet_gateway.default will be created
+ resource "aws_internet_gateway" "default" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"                                                         = "bemit-testing-test-k8s-cluster"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared"
        }
      + vpc_id   = (known after apply)
    }

  # module.test-k8s-cluster.module.vpc.aws_vpc.default will be created
+ resource "aws_vpc" "default" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = true
      + cidr_block                       = "172.16.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = false
      + enable_classiclink_dns_support   = false
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name"                                                         = "bemit-testing-test-k8s-cluster"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared"
        }
    }

  # module.test-k8s-cluster.module.eks_workers.module.autoscale_group.aws_autoscaling_group.default[0] will be created
+ resource "aws_autoscaling_group" "default" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = 300
      + desired_capacity          = (known after apply)
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_size                  = 4
      + metrics_granularity       = "1Minute"
      + min_elb_capacity          = 0
      + min_size                  = 2
      + name                      = (known after apply)
      + name_prefix               = "bemit-testing-test-k8s-cluster-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + tags                      = [
          + {
              + "key"                 = "Attributes"
              + "propagate_at_launch" = "true"
              + "value"               = "workers"
            },
          + {
              + "key"                 = "Name"
              + "propagate_at_launch" = "true"
              + "value"               = "bemit-testing-test-k8s-cluster-workers"
            },
          + {
              + "key"                 = "Namespace"
              + "propagate_at_launch" = "true"
              + "value"               = "bemit"
            },
          + {
              + "key"                 = "Stage"
              + "propagate_at_launch" = "true"
              + "value"               = "testing"
            },
          + {
              + "key"                 = "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster"
              + "propagate_at_launch" = "true"
              + "value"               = "owned"
            },
        ]
      + target_group_arns         = (known after apply)
      + termination_policies      = [
          + "Default",
        ]
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"
      + wait_for_elb_capacity     = 0

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }
    }

  # module.test-k8s-cluster.module.eks_workers.module.autoscale_group.aws_launch_template.default[0] will be created
+ resource "aws_launch_template" "default" {
      + arn                                  = (known after apply)
      + default_version                      = (known after apply)
      + disable_api_termination              = false
      + ebs_optimized                        = "false"
      + id                                   = (known after apply)
      + image_id                             = "ami-0eb6419458800872a"
      + instance_initiated_shutdown_behavior = "terminate"
      + instance_type                        = "t3a.small"
      + latest_version                       = (known after apply)
      + name                                 = (known after apply)
      + name_prefix                          = "bemit-testing-test-k8s-cluster-"
      + tags                                 = {
          + "Attributes"                                                   = "workers"
          + "Name"                                                         = "bemit-testing-test-k8s-cluster-workers"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "owned"
        }
      + user_data                            = (known after apply)

      + iam_instance_profile {
          + name = "bemit-testing-test-k8s-cluster-workers"
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = true
          + description                 = "bemit-testing-test-k8s-cluster"
          + device_index                = 0
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Attributes"                                                   = "workers"
              + "Name"                                                         = "bemit-testing-test-k8s-cluster-workers"
              + "Namespace"                                                    = "bemit"
              + "Stage"                                                        = "testing"
              + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "owned"
            }
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Attributes"                                                   = "workers"
              + "Name"                                                         = "bemit-testing-test-k8s-cluster-workers"
              + "Namespace"                                                    = "bemit"
              + "Stage"                                                        = "testing"
              + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "owned"
            }
        }
    }

Plan: 38 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d eks`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.247.12.82/lock?id=bmtoml%252Fatlaaaaaaantis%252Feks%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d eks`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
